name1 = input('Як тебе звати? (1): ')
name2 = input('Як тебе звати? (2): ')
name3 = input('Як тебе звати? (3): ')
name4 = input('Як тебе звати? (4): ')
name5 = input('Як тебе звати? (5): ')

print(name1, ', я тебе дуже радий бачити')
print(name1, ', ми сьогодні вивчимо функції')
print(name1, ', надіюся, що тобі сподобається')

print(name2, ', я тебе дуже радий бачити')
print(name2, ', ми сьогодні вивчимо функції')
print(name2, ', надіюся, що тобі сподобається')

print(name3, ', я тебе дуже радий бачити')
print(name3, ', ми сьогодні вивчимо функції')
print(name3, ', надіюся, що тобі сподобається')

print(name4, ', я тебе дуже радий бачити')
print(name4, ', ми сьогодні вивчимо функції')
print(name4, ', надіюся, що тобі сподобається')

print(name5, ', я тебе дуже радий бачити')
print(name5, ', ми сьогодні вивчимо функції')
print(name5, ', надіюся, що тобі сподобається')
