# Програма зчитує з клавіатури результат вводу користувачем та поміщає результат в змінну а
a = input("Ведіть число: ")
# перетворює змінну вмість змінної а з текствого типу в формат дійсних чисел
a = float(a)
# Програма зчитує з клавіатури результат вводу користувачем та поміщає результат в змінну n
n = input("Введіть степінь числа: ")
# перетворює змінну вмість змінної n з текствого типу в формат цілих  чисел
n = int(n)
# Програма обчислює степінь n числа а та поміщає результат в змінну b
b = a ** n
# значення змінних a, n та b виводяться на екран всередині фрази "a в степені n дорівнює  b"
#(замість змінниих виводяться їх значення)
print(a, " в степені" , n, " дорівнює ", b)