# Імпортуємо модуль tkinter
from tkinter import *


# Створюємо функцію яка буде обробляти натискання кнопки яку ми додамо
# Вона міняє напис у вікні на 'Молодець, в тебе все вийде!'
def press_btn(event):
    my_text['text'] = 'Молодець, в тебе все вийде!'


# Створюємо головне вікно за допомогою класу Tk
root = Tk()
# Створюємо надпис у вікні за допомогою класу Label
# параметри width=50, height=3 відповідають за ширину та висоту надпису відповідно
# для класу Label щирина береться в символах, а висота в рядках
my_text = Label(root, text='Привіт', width=50, height=3)
# Створюємо кнопку з написом 'Натисни мене'
btn = Button(root, text='Натисни мене')
# Пов'язуємо подію натискання кнопки з функцією press_btn
# Параметр <Button>  відповідає за клік на кнопуц мишкою
# Параметр press_btn - ім'я функції яка обробляє клік на кнопку.
btn.bind('<Button>', press_btn)
# Розміщуємо текст та кнопку в межах вікна за допомогою метода pack()
# В якому порядку до елементів застосовується метод pack, в такому вони й розмістяться
my_text.pack()
btn.pack()
# Функція mainloop відповідає за відображення вікна доки ми його не закриємо
root.mainloop()
