# Імпортуємо модуль tkinter
from tkinter import *

# Створюємо головне вікно за допомогою класу Tk
root = Tk()
# Створюємо надпис у вікні за допомогою класу Label
# параметри width=50, height=3 відповідають за ширину та висоту надпису відповідно
# для класу Label щирина береться в символах, а висота в рядках
my_text = Label(root, text='Привіт', width=50, height=3)
# Розміщуємо текст в межах вікна за допомогою метода pack()
my_text.pack()
# Функція mainloop відповідає за відображення вікна доки ми його не закриємо
root.mainloop()
